atanisoft/ESP32CommandStation/main/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2020 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "sdkconfig.h"
#include "ESP32TrainDatabase.h"

#include <AllTrainNodes.hxx>
#include <ConfigurationManager.h>
#include <DCCppProtocol.h>
#include <DCCProgrammer.h>
#include <dcc/Loco.hxx>
#include <Dnsd.h>
#include <DCCSignalVFS.h>
#include <esp_log.h>
#include <esp_ota_ops.h>
#include <freertos_drivers/esp32/Esp32WiFiManager.hxx>
#include <Httpd.h>
#include <json.hpp>
#include <JsonConstants.h>
#include <LCCStackManager.h>
#include <LCCWiFiManager.h>
#include <Turnouts.h>
#include <utils/FileUtils.hxx>
#include <utils/SocketClientParams.hxx>
#include <utils/StringPrintf.hxx>
#include "OTAMonitor.h"

#if CONFIG_GPIO_OUTPUTS
#include <Outputs.h>
#endif // CONFIG_GPIO_OUTPUTS

#if CONFIG_GPIO_SENSORS
#include <Sensors.h>
#include <RemoteSensors.h>
#if CONFIG_GPIO_S88
#include <S88Sensors.h>
#endif // CONFIG_GPIO_S88
#endif // CONFIG_GPIO_SENSORS

using http::Httpd;
using http::HttpMethod;
using http::HttpRequest;
using http::HttpStatusCode;
using http::AbstractHttpResponse;
using http::StringResponse;
using http::JsonResponse;
using http::WebSocketFlow;
using http::MIME_TYPE_TEXT_HTML;
using http::MIME_TYPE_TEXT_JAVASCRIPT;
using http::MIME_TYPE_TEXT_PLAIN;
using http::MIME_TYPE_TEXT_XML;
using http::MIME_TYPE_TEXT_CSS;
using http::MIME_TYPE_IMAGE_PNG;
using http::MIME_TYPE_IMAGE_GIF;
using http::HTTP_ENCODING_GZIP;
using http::WebSocketEvent;
using openlcb::TcpClientDefaultParams;

class WebSocketClient : public DCCPPProtocolConsumer
{
public:
  WebSocketClient(int clientID, uint32_t remoteIP)
    : DCCPPProtocolConsumer(), _id(clientID), _remoteIP(remoteIP)
  {
    LOG(INFO, "[WS %s] Connected", name().c_str());
  }
  virtual ~WebSocketClient()
  {
    LOG(INFO, "[WS %s] Disconnected", name().c_str());
  }
  int id()
  {
    return _id;
  }
  std::string name()
  {
    return StringPrintf("%s/%d", ipv4_to_string(_remoteIP).c_str(), _id);
  }
private:
  uint32_t _id;
  uint32_t _remoteIP;
};

// Captive Portal landing page
static constexpr const char * const CAPTIVE_PORTAL_HTML = R"!^!(
<html>
 <head>
  <title>ESP32 Command Station v%s</title>
  <meta http-equiv="refresh" content="30;url='/captiveauth'" />
 </head>
 <body>
  <h1>Welcome to the ESP32 Command Station</h1>
  <h2>Open your browser and navigate to any website and it will open the ESP32 Command Station</h2>
  <p>Click <a href="/captiveauth">here</a> to close this portal page if it does not automatically close.</p>
 </body>
</html>)!^!";

OSMutex webSocketLock;
std::vector<std::unique_ptr<WebSocketClient>> webSocketClients;
WEBSOCKET_STREAM_HANDLER(process_websocket_event);
HTTP_STREAM_HANDLER(process_ota);
HTTP_HANDLER(process_power);
HTTP_HANDLER(process_config);
HTTP_HANDLER(process_prog);
HTTP_HANDLER(process_turnouts);
HTTP_HANDLER(process_loco);
HTTP_HANDLER(process_outputs);
HTTP_HANDLER(process_sensors);
HTTP_HANDLER(process_remote_sensors);
HTTP_HANDLER(process_s88);

extern const uint8_t indexHtmlGz[] asm("_binary_index_html_gz_start");
extern const size_t indexHtmlGz_size asm("index_html_gz_length");

extern const uint8_t loco32x32[] asm("_binary_loco_32x32_png_start");
extern const size_t loco32x32_size asm("loco_32x32_png_length");

extern const uint8_t jqueryJsGz[] asm("_binary_jquery_min_js_gz_start");
extern const size_t jqueryJsGz_size asm("jquery_min_js_gz_length");

extern const uint8_t jqueryMobileJsGz[] asm("_binary_jquery_mobile_1_5_0_rc1_min_js_gz_start");
extern const size_t jqueryMobileJsGz_size asm("jquery_mobile_1_5_0_rc1_min_js_gz_length");

extern const uint8_t jqueryMobileCssGz[] asm("_binary_jquery_mobile_1_5_0_rc1_min_css_gz_start");
extern const size_t jqueryMobileCssGz_size asm("jquery_mobile_1_5_0_rc1_min_css_gz_length");

extern const uint8_t jquerySimpleWebSocketGz[] asm("_binary_jquery_simple_websocket_min_js_gz_start");
extern const size_t jquerySimpleWebSocketGz_size asm("jquery_simple_websocket_min_js_gz_length");

extern const uint8_t jqClockGz[] asm("_binary_jqClock_lite_min_js_gz_start");
extern const size_t jqClockGz_size asm("jqClock_lite_min_js_gz_length");

extern const uint8_t ajaxLoader[] asm("_binary_ajax_loader_gif_start");
extern const size_t ajaxLoader_size asm("ajax_loader_gif_length");

// CDI Helper which sets the provided path if it is different than the value
// passed in.
#define CDI_COMPARE_AND_SET(PATH, fd, value, updated) \
  {                                                   \
    auto current = PATH().read(fd);                   \
    if (current != value)                             \
    {                                                 \
      PATH().write(fd, value);                        \
      updated = true;                                 \
    }                                                 \
  }

// Helper which will trigger a config reload event to be queued when
// updated is true.
#define MAYBE_TRIGGER_UPDATE(updated)                         \
  if (updated)                                                \
  {                                                                                                    \
    Singleton<esp32cs::LCCStackManager>::instance()->stack()->executor()->add(new CallbackExecutable([&]()      \
    {                                                         \
      Singleton<esp32cs::LCCStackManager>::instance()->stack()->config_service()->trigger_update();             \
    }));                                                      \
  }

class WebConfigListener : public DefaultConfigUpdateListener
{
public:
  WebConfigListener(const esp32cs::Esp32ConfigDef &cfg) : fd_(-1), cfg_(cfg)
  {

