atanisoft/ESP32CommandStation/main/WebServer.cpp
  }

  UpdateAction apply_configuration(int fd, bool initial_load
                                 , BarrierNotifiable *done) override
  {
    AutoNotify n(done);
    // this is a no-op simply to capture the config FD.
    fd_ = fd;
    if (initial_load)
    {
      return UpdateAction::REINIT_NEEDED;
    }
    return UpdateAction::UPDATED;
  }

  void factory_reset(int fd) override
  {
    // no-op
  }

  void reconfigure_hbridge(uint8_t hbridge_index
                         , string short_on, string short_off
                         , string shutdown_on, string shutdown_off
                         , string thermal_on = "", string thermal_off = "")
  {
    bool upd = false;
    auto hbridge = cfg_.seg().hbridge().entry(hbridge_index);
    CDI_COMPARE_AND_SET(hbridge.event_short, fd_
                      , string_to_uint64(short_on), upd);
    CDI_COMPARE_AND_SET(hbridge.event_short_cleared, fd_
                      , string_to_uint64(short_off), upd);
    CDI_COMPARE_AND_SET(hbridge.event_shutdown, fd_
                      , string_to_uint64(shutdown_on), upd);
    CDI_COMPARE_AND_SET(hbridge.event_shutdown_cleared, fd_
                      , string_to_uint64(shutdown_off), upd);
    // only OPS has the thermal pin
    if (hbridge_index == esp32cs::OPS_CDI_TRACK_OUTPUT_IDX)
    {
      CDI_COMPARE_AND_SET(hbridge.event_thermal_shutdown, fd_
                        , string_to_uint64(thermal_on), upd);
      CDI_COMPARE_AND_SET(hbridge.event_thermal_shutdown_cleared, fd_
                        , string_to_uint64(thermal_off), upd);
    }
    MAYBE_TRIGGER_UPDATE(upd);
  }

  void reconfigure_uplink(SocketClientParams::SearchMode mode
                        , string uplink_service_name
                        , string manual_hostname
                        , uint16_t manual_port
                        , bool reconnect)
  {
    auto wifi = cfg_.seg().wifi();
    bool upd = false;
    CDI_COMPARE_AND_SET(wifi.uplink().search_mode, fd_, mode, upd);
    CDI_COMPARE_AND_SET(wifi.uplink().auto_address().service_name, fd_
                      , uplink_service_name, upd);
    CDI_COMPARE_AND_SET(wifi.uplink().manual_address().ip_address, fd_
                      , manual_hostname, upd);
    CDI_COMPARE_AND_SET(wifi.uplink().manual_address().port, fd_
                      , manual_port, upd);
    CDI_COMPARE_AND_SET(wifi.uplink().reconnect, fd_, reconnect, upd);

    MAYBE_TRIGGER_UPDATE(upd);
  }

  void reconfigure_lcc_hub(bool enabled)
  {
    bool upd = false;
    CDI_COMPARE_AND_SET(cfg_.seg().wifi().hub().enable, fd_, enabled, upd);
    MAYBE_TRIGGER_UPDATE(upd);
  }

  string get_config_json()
  {
    auto wifi = cfg_.seg().wifi();
    auto ops = cfg_.seg().hbridge().entry(esp32cs::OPS_CDI_TRACK_OUTPUT_IDX);
    auto prog = cfg_.seg().hbridge().entry(esp32cs::PROG_CDI_TRACK_OUTPUT_IDX);
    
    string config =
      StringPrintf("\"hub\":%s,"
                   "\"uplink\":{"
                     "\"reconnect\":%s,"
                     "\"auto_service\":\"%s\","
                     "\"manual_host\":\"%s\","
                     "\"manual_port\":%d,"
                     "\"mode\":%d"
                   "},"
                   "\"hbridges\":["
                     "{"
                       "\"short\":\"%s\","
                       "\"short_clear\":\"%s\","
                       "\"shutdown\":\"%s\","
                       "\"shutdown_clear\":\"%s\","
                       "\"thermal\":\"%s\","
                       "\"thermal_clear\":\"%s\""
                     "},"
                     "{"
                       "\"short\":\"%s\","
                       "\"short_clear\":\"%s\","
                       "\"shutdown\":\"%s\","
                       "\"shutdown_clear\":\"%s\""
                     "}"
                   "]"
                 , CDI_READ_TRIMMED(wifi.hub().enable, fd_) ? "true" : "false"
                 , CDI_READ_TRIMMED(wifi.uplink().reconnect, fd_) ? "true" : "false"
                 , wifi.uplink().auto_address().service_name().read(fd_).c_str()
                 , wifi.uplink().manual_address().ip_address().read(fd_).c_str()
                 , CDI_READ_TRIMMED(wifi.uplink().manual_address().port, fd_)
                 , CDI_READ_TRIMMED(wifi.uplink().search_mode, fd_)
                 , uint64_to_string_hex(ops.event_short().read(fd_)).c_str()
                 , uint64_to_string_hex(ops.event_short_cleared().read(fd_)).c_str()
                 , uint64_to_string_hex(ops.event_shutdown().read(fd_)).c_str()
                 , uint64_to_string_hex(ops.event_shutdown_cleared().read(fd_)).c_str()
                 , uint64_to_string_hex(ops.event_thermal_shutdown().read(fd_)).c_str()
                 , uint64_to_string_hex(ops.event_thermal_shutdown_cleared().read(fd_)).c_str()
                 , uint64_to_string_hex(prog.event_short().read(fd_)).c_str()
                 , uint64_to_string_hex(prog.event_short_cleared().read(fd_)).c_str()
                 , uint64_to_string_hex(prog.event_shutdown().read(fd_)).c_str()
                 , uint64_to_string_hex(prog.event_shutdown_cleared().read(fd_)).c_str());
    return config;
  }
private:
  int fd_;
  const esp32cs::Esp32ConfigDef cfg_;
};

std::unique_ptr<WebConfigListener> configListener;

void init_webserver(const esp32cs::Esp32ConfigDef &cfg)
{
  configListener.reset(new WebConfigListener(cfg));

  auto httpd = Singleton<Httpd>::instance();
  httpd->redirect_uri("/", "/index.html");
  // if the soft AP interface is enabled, setup the captive portal
  if (Singleton<esp32cs::LCCWiFiManager>::instance()->is_softap_enabled())
  {
    httpd->captive_portal(
      StringPrintf(CAPTIVE_PORTAL_HTML
                 , esp_ota_get_app_description()->version));
  } 
  httpd->static_uri("/index.html", indexHtmlGz, indexHtmlGz_size
                  , MIME_TYPE_TEXT_HTML, HTTP_ENCODING_GZIP);
  httpd->static_uri("/loco-32x32.png", loco32x32, loco32x32_size
                  , MIME_TYPE_IMAGE_PNG);
  httpd->static_uri("/jquery.min.js", jqueryJsGz, jqueryJsGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.js", jqueryMobileJsGz
                  , jqueryMobileJsGz_size, MIME_TYPE_TEXT_JAVASCRIPT
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.mobile-1.5.0-rc1.min.css", jqueryMobileCssGz
                  , jqueryMobileCssGz_size, MIME_TYPE_TEXT_CSS
                  , HTTP_ENCODING_GZIP);
  httpd->static_uri("/jquery.simple.websocket.min.js"
                  , jquerySimpleWebSocketGz, jquerySimpleWebSocketGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/jqClock-lite.min.js", jqClockGz, jqClockGz_size
                  , MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/images/ajax-loader.gif", ajaxLoader, ajaxLoader_size
                  , MIME_TYPE_IMAGE_GIF);
  httpd->websocket_uri("/ws", process_websocket_event);
  httpd->uri("/update", HttpMethod::POST, nullptr, process_ota);
  httpd->uri("/features", [&](HttpRequest *req)
  {
    string features = StringPrintf("{");
#if defined(CONFIG_GPIO_S88)
    features += StringPrintf("\"%s\":%d,\"%s\":true", JSON_S88_SENSOR_BASE_NODE
                          , CONFIG_GPIO_S88_FIRST_SENSOR, JSON_S88_NODE);
#else
    features += StringPrintf("\"%s\":%d,\"%s\":false", JSON_S88_SENSOR_BASE_NODE
                          , 0, JSON_S88_NODE);
#endif // CONFIG_GPIO_S88
#if defined(CONFIG_GPIO_OUTPUTS)
    features += StringPrintf(",\"%s\":true", JSON_OUTPUTS_NODE);
#else
    features += StringPrintf(",\"%s\":false", JSON_OUTPUTS_NODE);
#endif // CONFIG_GPIO_OUTPUTS
#if defined(CONFIG_GPIO_SENSORS)
    features += StringPrintf(",\"%s\":true", JSON_SENSORS_NODE);
#else
    features += StringPrintf(",\"%s\":false", JSON_SENSORS_NODE);
#endif // CONFIG_GPIO_SENSORS
    features += "}";
    return new JsonResponse(features);
  });
  httpd->uri("/version", [&](HttpRequest *req)
  {
    const esp_app_desc_t *app_data = esp_ota_get_app_description();
    const esp_partition_t *partition = esp_ota_get_running_partition();
    string version =
      StringPrintf("{\"version\":\"%s\",\"build\":\"%s\","
                    "\"timestamp\":\"%s %s\",\"ota\":\"%s\",\"uptime\":%llu}"
                 , CONFIG_ESP32CS_SW_VERSION, app_data->version
                 , app_data->date, app_data->time
                 , partition->label, esp_timer_get_time());
    return new JsonResponse(version);
  });
  httpd->uri("/fs", HttpMethod::GET, [&](HttpRequest *req)
  {
    string path = req->param("path");
    string data = read_file_to_string(path);
    string mimetype;
    if (path.find(".xml") != string::npos)
    {
      mimetype = MIME_TYPE_TEXT_XML;
    }
    else if (path.find(".json") != string::npos)
    {
      mimetype = http::MIME_TYPE_APPLICATION_JSON;
    }
    return new StringResponse(data, mimetype);
  });
  httpd->uri("/power", HttpMethod::GET | HttpMethod::PUT, process_power);
  httpd->uri("/config", HttpMethod::GET | HttpMethod::POST, process_config);
  httpd->uri("/programmer", HttpMethod::GET | HttpMethod::POST, process_prog);
  httpd->uri("/turnouts"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_turnouts);
  httpd->uri("/locomotive"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/roster"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
  httpd->uri("/locomotive/estop"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_loco);
#if CONFIG_GPIO_OUTPUTS
  httpd->uri("/outputs"
           , HttpMethod::GET | HttpMethod::POST |
             HttpMethod::PUT | HttpMethod::DELETE
           , process_outputs);
#endif // CONFIG_GPIO_OUTPUTS
#if CONFIG_GPIO_SENSORS
  httpd->uri("/sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_sensors);
  httpd->uri("/remoteSensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_remote_sensors);
#if CONFIG_GPIO_S88
  httpd->uri("/s88sensors"
          , HttpMethod::GET | HttpMethod::POST | HttpMethod::DELETE
          , process_s88);
#endif // CONFIG_GPIO_S88
#endif // CONFIG_GPIO_SENSORS
}

WEBSOCKET_STREAM_HANDLER_IMPL(process_websocket_event, client, event, data
                            , data_len)
{
  OSMutexLock h(&webSocketLock);
  if (event == WebSocketEvent::WS_EVENT_CONNECT)
  {
    webSocketClients.push_back(
      std::make_unique<WebSocketClient>(client->id(), client->ip()));
  }
  else if (event == WebSocketEvent::WS_EVENT_DISCONNECT)
  {
    webSocketClients.erase(std::remove_if(webSocketClients.begin()
                                        , webSocketClients.end()
    , [client](const auto &inst) -> bool
      {
        return inst->id() == client->id();
      }));
  }
  else if (event == WebSocketEvent::WS_EVENT_TEXT)
  {
    auto ent = std::find_if(webSocketClients.begin(), webSocketClients.end()
    , [client](const auto &inst) -> bool
      {
        return inst->id() == client->id();
      }
    );
    if (ent != webSocketClients.end())
    {
      // TODO: remove cast that drops const
      auto res = (*ent)->feed((uint8_t *)data, data_len);
      if (res.length())
      {
        client->send_text(res);
      }
    }
  }
}

esp_ota_handle_t otaHandle;
esp_partition_t *ota_partition = nullptr;
HTTP_STREAM_HANDLER_IMPL(process_ota, request, filename, size, data, length
                       , offset, final, abort_req)
{
  if (!offset)
  {
    esp_log_level_set("esp_image", ESP_LOG_VERBOSE);
    ota_partition = (esp_partition_t *)esp_ota_get_next_update_partition(NULL);
    esp_err_t err = ESP_ERROR_CHECK_WITHOUT_ABORT(
      esp_ota_begin(ota_partition, size, &otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA start failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update starting (%zu bytes, target:%s)...", size
      , ota_partition->label);
    esp32cs::disable_track_outputs();
    Singleton<OTAMonitorFlow>::instance()->report_start();
  }
  HASSERT(ota_partition);
  ESP_ERROR_CHECK(esp_ota_write(otaHandle, data, length));
  Singleton<OTAMonitorFlow>::instance()->report_progress(length);
  if (final)
  {
    esp_err_t err = ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_end(otaHandle));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA binary received, setting boot partition: %s"
      , ota_partition->label);
    err = ESP_ERROR_CHECK_WITHOUT_ABORT(
      esp_ota_set_boot_partition(ota_partition));
    if (err != ESP_OK)
    {
      LOG_ERROR("[WebSrv] OTA end failed, aborting!");
      Singleton<OTAMonitorFlow>::instance()->report_failure(err);
      request->set_status(HttpStatusCode::STATUS_SERVER_ERROR);
      *abort_req = true;
      return nullptr;
    }
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    Singleton<OTAMonitorFlow>::instance()->report_success();
    request->set_status(HttpStatusCode::STATUS_OK);
    return new StringResponse("OTA Upload Complete", MIME_TYPE_TEXT_PLAIN);
  }
  return nullptr;
}

HTTP_HANDLER_IMPL(process_power, request)
{
  string response = "{}";
  request->set_status(HttpStatusCode::STATUS_OK);
  if (request->method() == HttpMethod::GET)
  {
    response.assign(esp32cs::get_track_state_json());
  }
  else if (request->method() == HttpMethod::PUT)
  {
    if (request->param(JSON_STATE_NODE, false))
    {
      esp32cs::enable_ops_track_output();
    }
    else
    {
      esp32cs::disable_track_outputs();
    }
  }
  return new JsonResponse(response);
}

